Revit 2024 API
DockablePaneState Methods
The DockablePaneState type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetFloatingRectangle
 When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace